{"format": "graph-model", "generatedBy": "1.12.0", "convertedBy": "TensorFlow.js Converter v1.4.0", "userDefinedMetadata": {"signature": {"inputs": {"Placeholder:0": {"name": "Placeholder:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}, {"size": "7"}]}}, "Placeholder_1:0": {"name": "Placeholder_1:0", "dtype": "DT_FLOAT", "tensorShape": {"unknownRank": true}}, "is_training:0": {"name": "is_training:0", "dtype": "DT_BOOL", "tensorShape": {"unknownRank": true}}}, "outputs": {"Softmax:0": {"name": "Softmax:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}]}}, "Tanh:0": {"name": "Tanh:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}}, "modelTopology": {"node": [{"name": "is_training", "op": "Placeholder", "attr": {"shape": {"shape": {"unknownRank": true}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "dense_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "Placeholder", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "6"}, {"size": "7"}]}}}}, {"name": "Placeholder_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"unknownRank": true}}}}, {"name": "batch_normalization_5/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "512"}]}}}}}, {"name": "conv2d/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "batch_normalization/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/moving_mean", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "batch_normalization/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_3/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1"}]}}}}}, {"name": "conv2d_3/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "batch_normalization_5/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/moving_variance", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3072"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/Switch", "op": "Switch", "input": ["is_training", "is_training"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "batch_normalization_5/cond_1/Switch_2", "op": "Switch", "input": ["batch_normalization_5/moving_variance", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/cond_1/Switch_2", "op": "Switch", "input": ["batch_normalization_4/moving_variance", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Reshape", "op": "Reshape", "input": ["Placeholder", "Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "batch_normalization/cond/FusedBatchNorm_1/Switch_1", "op": "Switch", "input": ["batch_normalization/gamma", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/FusedBatchNorm_1/Switch_2", "op": "Switch", "input": ["batch_normalization/beta", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/FusedBatchNorm_1/Switch_3", "op": "Switch", "input": ["batch_normalization/moving_mean", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/FusedBatchNorm_1/Switch_4", "op": "Switch", "input": ["batch_normalization/moving_variance", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/cond/FusedBatchNorm_1/Switch_1", "op": "Switch", "input": ["batch_normalization_1/gamma", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/cond/FusedBatchNorm_1/Switch_2", "op": "Switch", "input": ["batch_normalization_1/beta", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/cond/FusedBatchNorm_1/Switch_3", "op": "Switch", "input": ["batch_normalization_1/moving_mean", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/cond/FusedBatchNorm_1/Switch_4", "op": "Switch", "input": ["batch_normalization_1/moving_variance", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/cond/FusedBatchNorm_1/Switch_1", "op": "Switch", "input": ["batch_normalization_2/gamma", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/cond/FusedBatchNorm_1/Switch_2", "op": "Switch", "input": ["batch_normalization_2/beta", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/cond/FusedBatchNorm_1/Switch_3", "op": "Switch", "input": ["batch_normalization_2/moving_mean", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/cond/FusedBatchNorm_1/Switch_4", "op": "Switch", "input": ["batch_normalization_2/moving_variance", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/cond/Switch_2", "op": "Switch", "input": ["batch_normalization_5/moving_mean", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/cond/FusedBatchNorm_1/Switch_1", "op": "Switch", "input": ["batch_normalization_3/gamma", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/cond/FusedBatchNorm_1/Switch_2", "op": "Switch", "input": ["batch_normalization_3/beta", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/cond/FusedBatchNorm_1/Switch_3", "op": "Switch", "input": ["batch_normalization_3/moving_mean", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/cond/FusedBatchNorm_1/Switch_4", "op": "Switch", "input": ["batch_normalization_3/moving_variance", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/cond/Switch_2", "op": "Switch", "input": ["batch_normalization_4/moving_mean", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/switch_t", "op": "Identity", "input": ["batch_normalization/cond/Switch:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "conv2d/BiasAdd", "op": "_FusedConv2D", "input": ["Reshape", "conv2d/kernel", "conv2d/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "batch_normalization/cond/Const", "op": "Const", "input": ["^batch_normalization/cond/switch_t"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}}}, {"name": "batch_normalization/cond/FusedBatchNorm_1/Switch", "op": "Switch", "input": ["conv2d/BiasAdd", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["batch_normalization/cond/FusedBatchNorm_1/Switch:1", "batch_normalization/cond/FusedBatchNorm_1/Switch_1:1", "batch_normalization/cond/FusedBatchNorm_1/Switch_2:1", "batch_normalization/cond/Const", "batch_normalization/cond/Const"], "attr": {"epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": true}}}, {"name": "batch_normalization/cond/FusedBatchNorm_1", "op": "FusedBatchNorm", "input": ["batch_normalization/cond/FusedBatchNorm_1/Switch", "batch_normalization/cond/FusedBatchNorm_1/Switch_1", "batch_normalization/cond/FusedBatchNorm_1/Switch_2", "batch_normalization/cond/FusedBatchNorm_1/Switch_3", "batch_normalization/cond/FusedBatchNorm_1/Switch_4"], "attr": {"data_format": {"s": "TkhXQw=="}, "is_training": {"b": false}, "epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/Merge", "op": "Merge", "input": ["batch_normalization/cond/FusedBatchNorm_1", "batch_normalization/cond/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "Relu", "op": "Relu", "input": ["batch_normalization/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/BiasAdd", "op": "_FusedConv2D", "input": ["Relu", "conv2d_1/kernel", "conv2d_1/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "batch_normalization_1/cond/FusedBatchNorm_1/Switch", "op": "Switch", "input": ["conv2d_1/BiasAdd", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/cond/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["batch_normalization_1/cond/FusedBatchNorm_1/Switch:1", "batch_normalization_1/cond/FusedBatchNorm_1/Switch_1:1", "batch_normalization_1/cond/FusedBatchNorm_1/Switch_2:1", "batch_normalization/cond/Const", "batch_normalization/cond/Const"], "attr": {"epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": true}}}, {"name": "batch_normalization_1/cond/FusedBatchNorm_1", "op": "FusedBatchNorm", "input": ["batch_normalization_1/cond/FusedBatchNorm_1/Switch", "batch_normalization_1/cond/FusedBatchNorm_1/Switch_1", "batch_normalization_1/cond/FusedBatchNorm_1/Switch_2", "batch_normalization_1/cond/FusedBatchNorm_1/Switch_3", "batch_normalization_1/cond/FusedBatchNorm_1/Switch_4"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": false}, "epsilon": {"f": 0.0010000000474974513}}}, {"name": "batch_normalization_1/cond/Merge", "op": "Merge", "input": ["batch_normalization_1/cond/FusedBatchNorm_1", "batch_normalization_1/cond/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "Relu_1", "op": "Relu", "input": ["batch_normalization_1/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/BiasAdd", "op": "_FusedConv2D", "input": ["Relu_1", "conv2d_2/kernel", "conv2d_2/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "batch_normalization_2/cond/FusedBatchNorm_1/Switch", "op": "Switch", "input": ["conv2d_2/BiasAdd", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/cond/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["batch_normalization_2/cond/FusedBatchNorm_1/Switch:1", "batch_normalization_2/cond/FusedBatchNorm_1/Switch_1:1", "batch_normalization_2/cond/FusedBatchNorm_1/Switch_2:1", "batch_normalization/cond/Const", "batch_normalization/cond/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": true}, "epsilon": {"f": 0.0010000000474974513}}}, {"name": "batch_normalization_2/cond/FusedBatchNorm_1", "op": "FusedBatchNorm", "input": ["batch_normalization_2/cond/FusedBatchNorm_1/Switch", "batch_normalization_2/cond/FusedBatchNorm_1/Switch_1", "batch_normalization_2/cond/FusedBatchNorm_1/Switch_2", "batch_normalization_2/cond/FusedBatchNorm_1/Switch_3", "batch_normalization_2/cond/FusedBatchNorm_1/Switch_4"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": false}, "epsilon": {"f": 0.0010000000474974513}}}, {"name": "batch_normalization_2/cond/Merge", "op": "Merge", "input": ["batch_normalization_2/cond/FusedBatchNorm_1", "batch_normalization_2/cond/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "Relu_2", "op": "Relu", "input": ["batch_normalization_2/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3/BiasAdd", "op": "_FusedConv2D", "input": ["Relu_2", "conv2d_3/kernel", "conv2d_3/bias"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "batch_normalization_3/cond/FusedBatchNorm_1/Switch", "op": "Switch", "input": ["conv2d_3/BiasAdd", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/cond/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["batch_normalization_3/cond/FusedBatchNorm_1/Switch:1", "batch_normalization_3/cond/FusedBatchNorm_1/Switch_1:1", "batch_normalization_3/cond/FusedBatchNorm_1/Switch_2:1", "batch_normalization/cond/Const", "batch_normalization/cond/Const"], "attr": {"epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": true}}}, {"name": "batch_normalization_3/cond/FusedBatchNorm_1", "op": "FusedBatchNorm", "input": ["batch_normalization_3/cond/FusedBatchNorm_1/Switch", "batch_normalization_3/cond/FusedBatchNorm_1/Switch_1", "batch_normalization_3/cond/FusedBatchNorm_1/Switch_2", "batch_normalization_3/cond/FusedBatchNorm_1/Switch_3", "batch_normalization_3/cond/FusedBatchNorm_1/Switch_4"], "attr": {"epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": false}}}, {"name": "batch_normalization_3/cond/Merge", "op": "Merge", "input": ["batch_normalization_3/cond/FusedBatchNorm_1", "batch_normalization_3/cond/FusedBatchNorm"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Relu_3", "op": "Relu", "input": ["batch_normalization_3/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Reshape_1", "op": "Reshape", "input": ["Relu_3", "Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense/BiasAdd", "op": "_FusedMatMul", "input": ["Reshape_1", "dense/kernel", "dense/bias"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "batch_normalization_4/moments/mean", "op": "Mean", "input": ["dense/BiasAdd", "batch_normalization_5/moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/moments/Squeeze", "op": "Squeeze", "input": ["batch_normalization_4/moments/mean"], "attr": {"squeeze_dims": {"list": {"i": ["0"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/moments/SquaredDifference", "op": "SquaredDifference", "input": ["batch_normalization_4/moments/mean", "dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/cond/Switch_1", "op": "Switch", "input": ["batch_normalization_4/moments/Squeeze", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/moments/variance", "op": "Mean", "input": ["batch_normalization_4/moments/SquaredDifference", "batch_normalization_5/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "batch_normalization_4/cond/Merge", "op": "Merge", "input": ["batch_normalization_4/cond/Switch_2", "batch_normalization_4/cond/Switch_1:1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/moments/Squeeze_1", "op": "Squeeze", "input": ["batch_normalization_4/moments/variance"], "attr": {"squeeze_dims": {"list": {"i": ["0"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/cond_1/Switch_1", "op": "Switch", "input": ["batch_normalization_4/moments/Squeeze_1", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/cond_1/Merge", "op": "Merge", "input": ["batch_normalization_4/cond_1/Switch_2", "batch_normalization_4/cond_1/Switch_1:1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/add", "op": "Add", "input": ["batch_normalization_4/cond_1/Merge", "batch_normalization_5/batchnorm/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["batch_normalization_4/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/mul", "op": "Mul", "input": ["batch_normalization_4/batchnorm/Rsqrt", "batch_normalization_4/gamma"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_4/batchnorm/mul", "dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/mul_2", "op": "Mul", "input": ["batch_normalization_4/batchnorm/mul", "batch_normalization_4/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/sub", "op": "Sub", "input": ["batch_normalization_4/beta", "batch_normalization_4/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_4/batchnorm/mul_1", "batch_normalization_4/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_4", "op": "Relu", "input": ["batch_normalization_4/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["Relu_4", "dense_1/kernel", "dense_1/bias"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "batch_normalization_5/moments/mean", "op": "Mean", "input": ["dense_1/BiasAdd", "batch_normalization_5/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "batch_normalization_5/moments/Squeeze", "op": "Squeeze", "input": ["batch_normalization_5/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "batch_normalization_5/moments/SquaredDifference", "op": "SquaredDifference", "input": ["batch_normalization_5/moments/mean", "dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/cond/Switch_1", "op": "Switch", "input": ["batch_normalization_5/moments/Squeeze", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/moments/variance", "op": "Mean", "input": ["batch_normalization_5/moments/SquaredDifference", "batch_normalization_5/moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/cond/Merge", "op": "Merge", "input": ["batch_normalization_5/cond/Switch_2", "batch_normalization_5/cond/Switch_1:1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/moments/Squeeze_1", "op": "Squeeze", "input": ["batch_normalization_5/moments/variance"], "attr": {"squeeze_dims": {"list": {"i": ["0"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/cond_1/Switch_1", "op": "Switch", "input": ["batch_normalization_5/moments/Squeeze_1", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/cond_1/Merge", "op": "Merge", "input": ["batch_normalization_5/cond_1/Switch_2", "batch_normalization_5/cond_1/Switch_1:1"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "batch_normalization_5/batchnorm/add", "op": "Add", "input": ["batch_normalization_5/batchnorm/add/y", "batch_normalization_5/cond_1/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["batch_normalization_5/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/mul", "op": "Mul", "input": ["batch_normalization_5/batchnorm/Rsqrt", "batch_normalization_5/gamma"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/mul_2", "op": "Mul", "input": ["batch_normalization_5/batchnorm/mul", "batch_normalization_5/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_5/batchnorm/mul", "dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/sub", "op": "Sub", "input": ["batch_normalization_5/beta", "batch_normalization_5/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_5/batchnorm/mul_1", "batch_normalization_5/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_5", "op": "Relu", "input": ["batch_normalization_5/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["Relu_5", "dense_2/kernel", "dense_2/bias"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["Relu_5", "dense_3/kernel", "dense_3/bias"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "Softmax", "op": "Softmax", "input": ["dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Tanh", "op": "Tanh", "input": ["dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 134}}, "weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"name": "dense_1/kernel", "shape": [1024, 512], "dtype": "float32", "quantization": {"min": -1.1656213774946305, "scale": 3.287978836971116e-05, "dtype": "uint16"}}, {"name": "dense_2/bias", "shape": [7], "dtype": "float32", "quantization": {"min": -0.1491909826407582, "scale": 7.421698469841718e-06, "dtype": "uint16"}}, {"name": "dense_1/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.0045277030560432925, "scale": 1.8228201844048845e-07, "dtype": "uint16"}}, {"name": "batch_normalization_5/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"min": 19.324983596801758, "scale": 0.0033623679147902095, "dtype": "uint16"}}, {"name": "batch_normalization_4/moving_variance", "shape": [1024], "dtype": "float32", "quantization": {"min": 18.310922622680664, "scale": 0.0009192334529672688, "dtype": "uint16"}}, {"name": "batch_normalization_5/moments/mean/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "conv2d/kernel", "shape": [3, 3, 1, 512], "dtype": "float32", "quantization": {"min": -2.6665909990453422, "scale": 8.77168091791231e-05, "dtype": "uint16"}}, {"name": "conv2d/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.20488991636955975, "scale": 6.418857029121546e-06, "dtype": "uint16"}}, {"name": "batch_normalization/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": 0.1046806126832962, "scale": 3.4970167191248516e-05, "dtype": "uint16"}}, {"name": "batch_normalization/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -0.951983273352203, "scale": 2.7271987662996046e-05, "dtype": "uint16"}}, {"name": "batch_normalization/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": -0.22152292718419478, "scale": 6.561698080100556e-06, "dtype": "uint16"}}, {"name": "batch_normalization/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"min": 0.040079839527606964, "scale": 5.153000566227591e-05, "dtype": "uint16"}}, {"name": "conv2d_1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -1.2351568112613827, "scale": 3.733960552802027e-05, "dtype": "uint16"}}, {"name": "conv2d_1/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.00499756257485664, "scale": 1.491809723837803e-07, "dtype": "uint16"}}, {"name": "batch_normalization_1/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": 0.1441197544336319, "scale": 2.434536708959264e-05, "dtype": "uint16"}}, {"name": "batch_normalization_1/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -0.798771858215332, "scale": 1.0532172564611816e-05, "dtype": "uint16"}}, {"name": "batch_normalization_1/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": -88.26313764159299, "scale": 0.002240181158416066, "dtype": "uint16"}}, {"name": "batch_normalization_5/batchnorm/add/y", "shape": [], "dtype": "float32", "quantization": {"min": 0.0010000000474974513, "scale": 1.0, "dtype": "uint16"}}, {"name": "batch_normalization_1/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"min": 405.6929016113281, "scale": 0.07480435920378305, "dtype": "uint16"}}, {"name": "conv2d_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -1.0409516663648466, "scale": 3.337988348131623e-05, "dtype": "uint16"}}, {"name": "conv2d_2/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.00507743970814365, "scale": 1.715988951348018e-07, "dtype": "uint16"}}, {"name": "batch_normalization_5/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": 0.15693731606006622, "scale": 1.546973206953807e-05, "dtype": "uint16"}}, {"name": "batch_normalization_2/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": 0.24526989459991455, "scale": 1.425662520567176e-05, "dtype": "uint16"}}, {"name": "batch_normalization_2/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -1.0954574346542358, "scale": 1.121621578647587e-05, "dtype": "uint16"}}, {"name": "batch_normalization_2/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": -12.356718811188827, "scale": 0.00042941057864848576, "dtype": "uint16"}}, {"name": "batch_normalization_2/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"min": 47.01006317138672, "scale": 0.0015468331690082708, "dtype": "uint16"}}, {"name": "batch_normalization_5/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -0.8280339198171788, "scale": 1.7416892848790097e-05, "dtype": "uint16"}}, {"name": "conv2d_3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"min": -1.076292138650105, "scale": 3.290608226275238e-05, "dtype": "uint16"}}, {"name": "dense_3/kernel", "shape": [512, 1], "dtype": "float32", "quantization": {"min": -0.7800685619811331, "scale": 1.9467159840810887e-05, "dtype": "uint16"}}, {"name": "conv2d_3/bias", "shape": [512], "dtype": "float32", "quantization": {"min": -0.00476772773363156, "scale": 1.556605744109034e-07, "dtype": "uint16"}}, {"name": "batch_normalization_5/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": -13.707577599254565, "scale": 0.0003149429647839023, "dtype": "uint16"}}, {"name": "batch_normalization_3/gamma", "shape": [512], "dtype": "float32", "quantization": {"min": 0.22062565386295319, "scale": 1.4804118220025946e-05, "dtype": "uint16"}}, {"name": "batch_normalization_3/beta", "shape": [512], "dtype": "float32", "quantization": {"min": -1.0090347528457642, "scale": 1.1192573110944685e-05, "dtype": "uint16"}}, {"name": "batch_normalization_3/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"min": -14.840807851999623, "scale": 0.0003897066291686262, "dtype": "uint16"}}, {"name": "batch_normalization_3/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"min": 43.49625015258789, "scale": 0.0013366267893401129, "dtype": "uint16"}}, {"name": "Reshape_1/shape", "shape": [2], "dtype": "int32"}, {"name": "dense/kernel", "shape": [3072, 1024], "dtype": "float32", "quantization": {"min": -1.0782478438913845, "scale": 3.419643664620166e-05, "dtype": "uint16"}}, {"name": "dense/bias", "shape": [1024], "dtype": "float32", "quantization": {"min": -0.0022610560813728993, "scale": 7.797820669654087e-08, "dtype": "uint16"}}, {"name": "batch_normalization_4/gamma", "shape": [1024], "dtype": "float32", "quantization": {"min": 0.23714785277843475, "scale": 2.180711190942642e-05, "dtype": "uint16"}}, {"name": "batch_normalization_4/beta", "shape": [1024], "dtype": "float32", "quantization": {"min": -1.2976547141101327, "scale": 2.4575397498440102e-05, "dtype": "uint16"}}, {"name": "dense_2/kernel", "shape": [512, 7], "dtype": "float32", "quantization": {"min": -1.2265789461888938, "scale": 2.6017158684672687e-05, "dtype": "uint16"}}, {"name": "batch_normalization_4/moving_mean", "shape": [1024], "dtype": "float32", "quantization": {"min": -11.128959987987013, "scale": 0.0003441343266021526, "dtype": "uint16"}}, {"name": "dense_3/bias", "shape": [1], "dtype": "float32", "quantization": {"min": 0.0057298471219837666, "scale": 1.0, "dtype": "uint16"}}, {"name": "batch_normalization/cond/Const", "shape": [0], "dtype": "float32"}]}]}