{"format": "graph-model", "generatedBy": "1.12.0", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"node": [{"name": "is_training", "op": "Placeholder", "attr": {"dtype": {"type": "DT_BOOL"}, "shape": {"shape": {"unknownRank": true}}}}, {"name": "dense_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_1/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "Placeholder", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "6"}, {"size": "7"}]}}}}, {"name": "Placeholder_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"unknownRank": true}}}}, {"name": "batch_normalization_5/moving_variance", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "batch_normalization_4/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "batch_normalization/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "batch_normalization_1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/moving_variance", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "batch_normalization_5/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}}, {"name": "dense_3/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1"}]}}}}}, {"name": "conv2d_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3072"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "batch_normalization_4/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "batch_normalization_4/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_2/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "7"}]}}}}}, {"name": "batch_normalization_4/moving_mean", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "dense_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/Switch", "op": "Switch", "input": ["is_training", "is_training"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "batch_normalization_5/cond_1/Switch_2", "op": "Switch", "input": ["batch_normalization_5/moving_variance", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/cond_1/Switch_2", "op": "Switch", "input": ["batch_normalization_4/moving_variance", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Reshape", "op": "Reshape", "input": ["Placeholder", "Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "batch_normalization/cond/FusedBatchNorm_1/Switch_1", "op": "Switch", "input": ["batch_normalization/gamma", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/FusedBatchNorm_1/Switch_2", "op": "Switch", "input": ["batch_normalization/beta", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/FusedBatchNorm_1/Switch_3", "op": "Switch", "input": ["batch_normalization/moving_mean", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/FusedBatchNorm_1/Switch_4", "op": "Switch", "input": ["batch_normalization/moving_variance", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/cond/FusedBatchNorm_1/Switch_1", "op": "Switch", "input": ["batch_normalization_1/gamma", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/cond/FusedBatchNorm_1/Switch_2", "op": "Switch", "input": ["batch_normalization_1/beta", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/cond/FusedBatchNorm_1/Switch_3", "op": "Switch", "input": ["batch_normalization_1/moving_mean", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/cond/FusedBatchNorm_1/Switch_4", "op": "Switch", "input": ["batch_normalization_1/moving_variance", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/cond/FusedBatchNorm_1/Switch_1", "op": "Switch", "input": ["batch_normalization_2/gamma", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/cond/FusedBatchNorm_1/Switch_2", "op": "Switch", "input": ["batch_normalization_2/beta", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/cond/FusedBatchNorm_1/Switch_3", "op": "Switch", "input": ["batch_normalization_2/moving_mean", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/cond/FusedBatchNorm_1/Switch_4", "op": "Switch", "input": ["batch_normalization_2/moving_variance", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/cond/Switch_2", "op": "Switch", "input": ["batch_normalization_5/moving_mean", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/cond/FusedBatchNorm_1/Switch_1", "op": "Switch", "input": ["batch_normalization_3/gamma", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/cond/FusedBatchNorm_1/Switch_2", "op": "Switch", "input": ["batch_normalization_3/beta", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/cond/FusedBatchNorm_1/Switch_3", "op": "Switch", "input": ["batch_normalization_3/moving_mean", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/cond/FusedBatchNorm_1/Switch_4", "op": "Switch", "input": ["batch_normalization_3/moving_variance", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/cond/Switch_2", "op": "Switch", "input": ["batch_normalization_4/moving_mean", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/switch_t", "op": "Identity", "input": ["batch_normalization/cond/Switch:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "conv2d/Conv2D", "op": "Conv2D", "input": ["Reshape", "conv2d/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "batch_normalization/cond/Const", "op": "Const", "input": ["^batch_normalization/cond/switch_t"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}}}, {"name": "conv2d/BiasAdd", "op": "BiasAdd", "input": ["conv2d/Conv2D", "conv2d/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/FusedBatchNorm_1/Switch", "op": "Switch", "input": ["conv2d/BiasAdd", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["batch_normalization/cond/FusedBatchNorm_1/Switch:1", "batch_normalization/cond/FusedBatchNorm_1/Switch_1:1", "batch_normalization/cond/FusedBatchNorm_1/Switch_2:1", "batch_normalization/cond/Const", "batch_normalization/cond/Const"], "attr": {"data_format": {"s": "TkhXQw=="}, "is_training": {"b": true}, "epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/FusedBatchNorm_1", "op": "FusedBatchNorm", "input": ["batch_normalization/cond/FusedBatchNorm_1/Switch", "batch_normalization/cond/FusedBatchNorm_1/Switch_1", "batch_normalization/cond/FusedBatchNorm_1/Switch_2", "batch_normalization/cond/FusedBatchNorm_1/Switch_3", "batch_normalization/cond/FusedBatchNorm_1/Switch_4"], "attr": {"data_format": {"s": "TkhXQw=="}, "is_training": {"b": false}, "epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization/cond/Merge", "op": "Merge", "input": ["batch_normalization/cond/FusedBatchNorm_1", "batch_normalization/cond/FusedBatchNorm"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Relu", "op": "Relu", "input": ["batch_normalization/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/Conv2D", "op": "Conv2D", "input": ["Relu", "conv2d_1/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv2d_1/BiasAdd", "op": "BiasAdd", "input": ["conv2d_1/Conv2D", "conv2d_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "batch_normalization_1/cond/FusedBatchNorm_1/Switch", "op": "Switch", "input": ["conv2d_1/BiasAdd", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/cond/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["batch_normalization_1/cond/FusedBatchNorm_1/Switch:1", "batch_normalization_1/cond/FusedBatchNorm_1/Switch_1:1", "batch_normalization_1/cond/FusedBatchNorm_1/Switch_2:1", "batch_normalization/cond/Const", "batch_normalization/cond/Const"], "attr": {"epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": true}}}, {"name": "batch_normalization_1/cond/FusedBatchNorm_1", "op": "FusedBatchNorm", "input": ["batch_normalization_1/cond/FusedBatchNorm_1/Switch", "batch_normalization_1/cond/FusedBatchNorm_1/Switch_1", "batch_normalization_1/cond/FusedBatchNorm_1/Switch_2", "batch_normalization_1/cond/FusedBatchNorm_1/Switch_3", "batch_normalization_1/cond/FusedBatchNorm_1/Switch_4"], "attr": {"epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": false}}}, {"name": "batch_normalization_1/cond/Merge", "op": "Merge", "input": ["batch_normalization_1/cond/FusedBatchNorm_1", "batch_normalization_1/cond/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "Relu_1", "op": "Relu", "input": ["batch_normalization_1/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/Conv2D", "op": "Conv2D", "input": ["Relu_1", "conv2d_2/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "conv2d_2/BiasAdd", "op": "BiasAdd", "input": ["conv2d_2/Conv2D", "conv2d_2/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "batch_normalization_2/cond/FusedBatchNorm_1/Switch", "op": "Switch", "input": ["conv2d_2/BiasAdd", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/cond/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["batch_normalization_2/cond/FusedBatchNorm_1/Switch:1", "batch_normalization_2/cond/FusedBatchNorm_1/Switch_1:1", "batch_normalization_2/cond/FusedBatchNorm_1/Switch_2:1", "batch_normalization/cond/Const", "batch_normalization/cond/Const"], "attr": {"epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": true}}}, {"name": "batch_normalization_2/cond/FusedBatchNorm_1", "op": "FusedBatchNorm", "input": ["batch_normalization_2/cond/FusedBatchNorm_1/Switch", "batch_normalization_2/cond/FusedBatchNorm_1/Switch_1", "batch_normalization_2/cond/FusedBatchNorm_1/Switch_2", "batch_normalization_2/cond/FusedBatchNorm_1/Switch_3", "batch_normalization_2/cond/FusedBatchNorm_1/Switch_4"], "attr": {"epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": false}}}, {"name": "batch_normalization_2/cond/Merge", "op": "Merge", "input": ["batch_normalization_2/cond/FusedBatchNorm_1", "batch_normalization_2/cond/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "Relu_2", "op": "Relu", "input": ["batch_normalization_2/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3/Conv2D", "op": "Conv2D", "input": ["Relu_2", "conv2d_3/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv2d_3/BiasAdd", "op": "BiasAdd", "input": ["conv2d_3/Conv2D", "conv2d_3/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "batch_normalization_3/cond/FusedBatchNorm_1/Switch", "op": "Switch", "input": ["conv2d_3/BiasAdd", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/cond/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["batch_normalization_3/cond/FusedBatchNorm_1/Switch:1", "batch_normalization_3/cond/FusedBatchNorm_1/Switch_1:1", "batch_normalization_3/cond/FusedBatchNorm_1/Switch_2:1", "batch_normalization/cond/Const", "batch_normalization/cond/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": true}, "epsilon": {"f": 0.0010000000474974513}}}, {"name": "batch_normalization_3/cond/FusedBatchNorm_1", "op": "FusedBatchNorm", "input": ["batch_normalization_3/cond/FusedBatchNorm_1/Switch", "batch_normalization_3/cond/FusedBatchNorm_1/Switch_1", "batch_normalization_3/cond/FusedBatchNorm_1/Switch_2", "batch_normalization_3/cond/FusedBatchNorm_1/Switch_3", "batch_normalization_3/cond/FusedBatchNorm_1/Switch_4"], "attr": {"epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": false}}}, {"name": "batch_normalization_3/cond/Merge", "op": "Merge", "input": ["batch_normalization_3/cond/FusedBatchNorm_1", "batch_normalization_3/cond/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "Relu_3", "op": "Relu", "input": ["batch_normalization_3/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Reshape_1", "op": "Reshape", "input": ["Relu_3", "Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense/MatMul", "op": "MatMul", "input": ["Reshape_1", "dense/kernel"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "dense/BiasAdd", "op": "BiasAdd", "input": ["dense/MatMul", "dense/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "batch_normalization_4/moments/mean", "op": "Mean", "input": ["dense/BiasAdd", "batch_normalization_5/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "batch_normalization_4/moments/Squeeze", "op": "Squeeze", "input": ["batch_normalization_4/moments/mean"], "attr": {"squeeze_dims": {"list": {"i": ["0"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/moments/SquaredDifference", "op": "SquaredDifference", "input": ["batch_normalization_4/moments/mean", "dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/cond/Switch_1", "op": "Switch", "input": ["batch_normalization_4/moments/Squeeze", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/moments/variance", "op": "Mean", "input": ["batch_normalization_4/moments/SquaredDifference", "batch_normalization_5/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "batch_normalization_4/cond/Merge", "op": "Merge", "input": ["batch_normalization_4/cond/Switch_2", "batch_normalization_4/cond/Switch_1:1"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "batch_normalization_4/moments/Squeeze_1", "op": "Squeeze", "input": ["batch_normalization_4/moments/variance"], "attr": {"squeeze_dims": {"list": {"i": ["0"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/cond_1/Switch_1", "op": "Switch", "input": ["batch_normalization_4/moments/Squeeze_1", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/cond_1/Merge", "op": "Merge", "input": ["batch_normalization_4/cond_1/Switch_2", "batch_normalization_4/cond_1/Switch_1:1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/add", "op": "Add", "input": ["batch_normalization_4/cond_1/Merge", "batch_normalization_5/batchnorm/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["batch_normalization_4/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/mul", "op": "Mul", "input": ["batch_normalization_4/batchnorm/Rsqrt", "batch_normalization_4/gamma"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_4/batchnorm/mul", "dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/mul_2", "op": "Mul", "input": ["batch_normalization_4/batchnorm/mul", "batch_normalization_4/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/sub", "op": "Sub", "input": ["batch_normalization_4/beta", "batch_normalization_4/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_4/batchnorm/mul_1", "batch_normalization_4/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_4", "op": "Relu", "input": ["batch_normalization_4/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_1/MatMul", "op": "MatMul", "input": ["Relu_4", "dense_1/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "dense_1/BiasAdd", "op": "BiasAdd", "input": ["dense_1/MatMul", "dense_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "batch_normalization_5/moments/mean", "op": "Mean", "input": ["dense_1/BiasAdd", "batch_normalization_5/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/moments/Squeeze", "op": "Squeeze", "input": ["batch_normalization_5/moments/mean"], "attr": {"squeeze_dims": {"list": {"i": ["0"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/moments/SquaredDifference", "op": "SquaredDifference", "input": ["batch_normalization_5/moments/mean", "dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/cond/Switch_1", "op": "Switch", "input": ["batch_normalization_5/moments/Squeeze", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/moments/variance", "op": "Mean", "input": ["batch_normalization_5/moments/SquaredDifference", "batch_normalization_5/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "batch_normalization_5/cond/Merge", "op": "Merge", "input": ["batch_normalization_5/cond/Switch_2", "batch_normalization_5/cond/Switch_1:1"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "batch_normalization_5/moments/Squeeze_1", "op": "Squeeze", "input": ["batch_normalization_5/moments/variance"], "attr": {"squeeze_dims": {"list": {"i": ["0"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/cond_1/Switch_1", "op": "Switch", "input": ["batch_normalization_5/moments/Squeeze_1", "is_training"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/cond_1/Merge", "op": "Merge", "input": ["batch_normalization_5/cond_1/Switch_2", "batch_normalization_5/cond_1/Switch_1:1"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "batch_normalization_5/batchnorm/add", "op": "Add", "input": ["batch_normalization_5/batchnorm/add/y", "batch_normalization_5/cond_1/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["batch_normalization_5/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/mul", "op": "Mul", "input": ["batch_normalization_5/batchnorm/Rsqrt", "batch_normalization_5/gamma"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/mul_2", "op": "Mul", "input": ["batch_normalization_5/batchnorm/mul", "batch_normalization_5/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_5/batchnorm/mul", "dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/sub", "op": "Sub", "input": ["batch_normalization_5/beta", "batch_normalization_5/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_5/batchnorm/mul_1", "batch_normalization_5/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_5", "op": "Relu", "input": ["batch_normalization_5/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_2/MatMul", "op": "MatMul", "input": ["Relu_5", "dense_2/kernel"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "dense_3/MatMul", "op": "MatMul", "input": ["Relu_5", "dense_3/kernel"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "dense_2/BiasAdd", "op": "BiasAdd", "input": ["dense_2/MatMul", "dense_2/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "dense_3/BiasAdd", "op": "BiasAdd", "input": ["dense_3/MatMul", "dense_3/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Softmax", "op": "Softmax", "input": ["dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Tanh", "op": "Tanh", "input": ["dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 71}}, "weightsManifest": [{"paths": ["group1-shard1of11.bin", "group1-shard2of11.bin", "group1-shard3of11.bin", "group1-shard4of11.bin", "group1-shard5of11.bin", "group1-shard6of11.bin", "group1-shard7of11.bin", "group1-shard8of11.bin", "group1-shard9of11.bin", "group1-shard10of11.bin", "group1-shard11of11.bin"], "weights": [{"name": "dense_1/kernel", "shape": [1024, 512], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [7], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_5/moments/mean/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "conv2d/kernel", "shape": [3, 3, 1, 512], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_1/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/batchnorm/add/y", "shape": [], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [512], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [512, 1], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_3/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "Reshape_1/shape", "shape": [2], "dtype": "int32"}, {"name": "dense/kernel", "shape": [3072, 1024], "dtype": "float32"}, {"name": "dense/bias", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [1024], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [512, 7], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization/cond/Const", "shape": [0], "dtype": "float32"}]}]}